[
    ["my name is (.*)", ["Hello %1, How are you today ?"]],
    ["hi|hey|hello", ["Hello", "Hey there"]],
    ["what is your name ?", ["I am a bot created to resolve your query over admission enquiry!"]],
    ["how are you ?", ["I'm doing good! How about You ?"]],
    ["sorry (.*)", ["Its alright","Its OK, never mind"]],
    ["I am fine", ["Great to hear that, How can I help you?"]],
    ["i'm (.*) doing good", ["Nice to hear that","How can I help you?,)"]],
    ["(.*) age?", ["I'm a computer program dudenSeriously you are asking me this?"]],
    ["(.*) (location|city) ?", ["Mumbai, Maharashtra"]],
    ["how (.*) health(.*)", ["I'm a computer program, so I'm always healthy "]],
    ["(.*) (courses do you provide|course do you provide)", ["We offer a wide range of programs including Engineering, Business, Arts, and Sciences"]],
    ["(.*) office", ["Mumbai, Maharashtra"]],
    ["(.*) admission dates", ["Admission dates varies from 10 July 2023 to 15 August 2023"]],
    ["(.*) apply for admission", ["You can apply for admission online through our website. Make sure to complete the application form and submit the required documents."]],
    ["(.*) financial aid", ["Yes, we offer various financial aid options including scholarships, grants, and loans. You can find more information on our website."]],
    ["(.*) application deadline", ["The application deadline depends on the program you're applying for. Please refer to our website for specific deadlines"]],
    ["(.*) (campus housing|hostel)", ["Yes, we provide on-campus housing options for students. You can learn more about housing facilities on our website"]],
    ["(.*) campus tour", ["Of course! We offer campus tours for prospective students. You can book a tour on our website"]],
    ["(.*) admissions office", ["You can reach our admissions office by phone at (123) 456-7890 or by address provided over website."]],
    ["(.*) (admission process|take admission|enroll )", ["Visit our webiste and submit the form after that submit the document in office!"]],
    ["(.*) document", ["The required documents are SSC, HSC marksheet, Addhar Card xerox"]],
    ["(.*) (courses duration|course duration|duration of course)", ["The course duration is of 3 years"]],
    ["(.*) (courses Fees| course Fees)", ["The course fees varies from 26,000 to 30,000"]],
    ["(.*)  admission process", ["Our admission process involves filling out an online application form, submitting required documents, and attending an interview."]],
    ["(.*)  admission requirements", ["Admission requirements vary by program but generally include high school transcripts, standardized test scores, and letters of recommendation."]],
    ["(.*)  eligibility criteria", ["Eligibility criteria differ for each program. Please check our website or contact our admissions office for specific eligibility details."]],
    ["(.*)  application deadline", ["Application deadlines vary by program. You can find program-specific deadlines on our website."]],
    ["(.*)  tuition fees", ["Tuition fees vary based on the program. You can check the fees for each program on our website."]],
    ["(.*)  financial aid", ["We offer various financial aid options, including scholarships, grants, and loans. You can find more information on our financial aid page."]],
    ["(.*)  available courses", ["We offer a wide range of courses, including Engineering, Business, Arts, Sciences, and more. You can explore all available programs on our website."]],
    ["(.*)  course duration",  ["The duration of each course varies. Most undergraduate programs are typically 3-4 years, while postgraduate programs can be 1-2 years."]],
    ["(.*)  contact admissions", ["You can contact our admissions office by phone at (123) 456-7890 or by email at admissions@example.com."]],
    [" (.*) courses do you offer?", ["We offer a variety of courses, including BSc Computer Science and BSc Information Technology (IT)."]],
    [" (.*) (BSc CS| bsccs| BSC Computer science)", ["BSc Computer Science is a three-year undergraduate program that covers topics in computer science, programming, and software development."]],
    [" (.*) (BSc IT| bscit| BSC Information technology)", ["BSc Information Technology (IT) is a three-year program that focuses on information technology, networking, and database management."]],
    [" (.*) eligibility criteria", ["Eligibility criteria for BSc Computer Science and BSc IT include completing high school with a certain percentage in relevant subjects. Specific requirements can be found on our website."]],
    [" (.*) apply ", ["You can apply for these courses by visiting our website and filling out the online application form. Be sure to submit the required documents."]],
    [" (.*) course duration?", ["Both BSc Computer Science and BSc IT are three-year undergraduate programs."]],
    [" (.*) career after", ["Graduates of these courses can pursue careers as software developers, IT consultants, network administrators, and more."]],
    [" (.*) (faculty|teacher|staff).", ["Our faculty members are experienced professionals with expertise in computer science and IT. They provide quality education and guidance to our students."]],
    [" (.*) course fee", ["The course fees may vary, so it's best to check our website for the most up-to-date information on fees and any available scholarships."]],
    ["quit", ["Bye take care. See you soon ,) ","It was nice talking to you. See you soon)"]]
]